ERP DEV.WMS/src/Documents/вмс_ОперацияПоЯчейкам/вмс_ОперацияПоЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вмс_ОперацияПоЯчейкам</name>
  <registerRecords>InformationRegister.вмс_ИсторияИерархииКонтейнеров</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ОстаткиВКонтейнерах</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ЗаданияКладовщикам</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ОперацияПоЯчейкам</registerRecords>
  <registerRecords>InformationRegister.вмс_МестоположенияКонтейнеров</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Готов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучноеРедактированиеИерархии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаСУпаковками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучныеИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСубОперации</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеКладовщику</name>
    <type>
      <types>DocumentRef.вмс_ЗаданиеКладовщику</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <comment>Должен быть составной тип, чтобы вести серии, если типовые отключены</comment>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовыхЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаТранзит</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПриемник</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриемник</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерОтправитель</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сборка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриравнятьКоличество</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <comment>Может хранить номер строки таблицы инвентаризации, чтобы ссылаться на нее в случае ошибки проведения</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторИнструкции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ПересчетКонтейнераРодителя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыПоИнвентаризации</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовыхЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриемник</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерОтправитель</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторИнструкции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИерархияКонтейнеров</name>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерРасход</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриход</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АгрегацияКонтейнеров</name>
    <comment>Используется для сборки\разборки товаров в контейнеры</comment>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриемник</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Маркировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <comment>Хранит фактически отсканированную маркировку товара</comment>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Маркировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйКодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <comment>Партионный учет</comment>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиПрограммы/вмс_НастройкиПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиПрограммы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>EnumRef.вмс_ТипыПодключенияКИС</types>
      <types>CatalogRef.вмс_МестаХранения</types>
      <types>Boolean</types>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef.вмс_СпособыУпаковкиДанныхОбмена</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЗагружатьИзИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяХранилище</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Форма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Documents/вмс_ОперацияПоЯчейкам/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьНастройкиВидимостиЭлементов();
	УстановитьАктивнуюСтраницу();
	
	УстановитьСвязиВыбора();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Версия = 2;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	вмс_РаботаСФормамиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	вмс_РаботаСФормамиКлиент.ВключитьАвтоОбновлениеДокумента(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	
	Если Модифицированность Тогда
		Объект.РучныеИзменения = Истина;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	вмс_РаботаСФормамиКлиент.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	вмс_РаботаСФормамиКлиент.ПриЗакрытии(ЭтаФорма, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимостьДляИнвентаризации();
КонецПроцедуры     

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИерархияКонтейнеров

&НаКлиенте
Процедура ИерархияКонтейнеровПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//Кулалаев
	//При ручном редактировании таблицы иерархии устанавливаем признак ручного редактирования, чтобы не пересчитывать таблицу иерархии при записи.
	Объект.РучноеРедактированиеИерархии = Истина;
КонецПроцедуры     

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьДвижения(Команда)
	ВыполнитьДвиженияНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьДвиженияНаСервере()   
	
	Если Объект.ПометкаУдаления = Ложь Тогда
		
		Документ = РеквизитФормыВЗначение("Объект");
		Документ.ДополнительныеСвойства.Вставить("ОбменДанными", Истина);
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция УстановитьНастройкиВидимостиЭлементов()  
	
	//ИспользоватьКодыМаркировкиТоваров = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ИспользоватьКодыМаркировкиТоваров", Ложь); 	
	//Элементы.ОсновнаяПанельСтраницаКодыМаркировки.Видимость = ИспользоватьКодыМаркировкиТоваров; 
	//Элементы.АгрегацияКонтейнеровМаркировка.Видимость = ИспользоватьКодыМаркировкиТоваров;
	
	УстановитьВидимостьДляИнвентаризации();  
	
	//ТУ_Кошелев 14.09.23 ++
	ИспользоватьПомещения = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ИспользоватьПомещения", Ложь); 	
	Элементы.Помещение.Видимость = ИспользоватьПомещения;
	//ТУ_Кошелев 14.09.23 --
КонецФункции 

&НаСервере
Функция УстановитьВидимостьДляИнвентаризации()
	
	ЭтоОперацияИнвентаризации = Объект.ВидОперации.ЭтоИнвентаризация;
	
	Элементы.ОсновнаяПанельСтраницаТовары.Видимость = НЕ ЭтоОперацияИнвентаризации;
	Элементы.ОсновнаяПанельСтраницаТоварыПоИнвентаризации.Видимость = ЭтоОперацияИнвентаризации;
	
КонецФункции

&НаСервере
Функция УстановитьАктивнуюСтраницу()
	
	ПриоритетыТаблиц = Новый Массив;
	ПриоритетыТаблиц.Добавить("Товары");
	ПриоритетыТаблиц.Добавить("ТоварыПоИнвентаризации");
	ПриоритетыТаблиц.Добавить("АгрегацияКонтейнеров");
	ПриоритетыТаблиц.Добавить("ИерархияКонтейнеров");
	ПриоритетыТаблиц.Добавить("КодыМаркировки");
	
	Для Каждого ИмяТаблицы Из ПриоритетыТаблиц Цикл
		Если Объект[ИмяТаблицы].Количество() > 0 Тогда
			ИмяСтраницы = "ОсновнаяПанельСтраница" + ИмяТаблицы;
			Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы[ИмяСтраницы];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции


&НаСервере
Процедура УстановитьСвязиВыбора() 
	
	Если вмс_АдаптацияКонфигураций.ЭтоУТ() ИЛИ вмс_АдаптацияКонфигураций.ЭтоЕРП() Тогда 
		
		// установка связей параметров выбора
		// по владельцу характеристике
		
		Элементы.ТоварыХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый массив);
		
		Связи = Новый Массив();
		НоваяСвязь = Новый СвязьПараметраВыбора("Номенклатура", "Элементы.Товары.ТекущиеДанные.Товар");	
		Связи.Добавить(НоваяСвязь); 
		
		Элементы.ТоварыХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);
		
		
	КонецЕсли; 
	
	Если вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		
		Элементы.ТоварыХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый массив);
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы.Товары.ТекущиеДанные.Товар");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);	
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПоДвижениямОстатков(Команда)
	
	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии", Истина);
	ФормаОтчета = ПолучитьФорму("Отчет.вмс_ДвиженияТоваровВЯчейках.Форма", ПараметрыФормы);
	ФормаОтчета.Открыть();

	Отчет = ФормаОтчета.Отчет;
	ПоляОтбора = Новый Структура("Ячейка, Товар, Характеристика, Серия");
	ЗаполнитьЗначенияСвойств(ПоляОтбора, Элементы.Товары.ТекущиеДанные);
	УстановитьОтборСКД(Отчет.КомпоновщикНастроек, ПоляОтбора);
	УстановитьПериодСКД(Отчет.КомпоновщикНастроек, НачалоДня(Объект.Дата), КонецДня(Объект.Дата));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьОтборСКД(КомпоновщикНастроек, ПоляОтбора)
	
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для Каждого ПолеОтбора Из ПоляОтбора Цикл
		
		ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ПолеОтбора.Ключ);
		ЭлементОтбораНайден = Ложь;
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.ЛевоеЗначение=ПолеКомпоновки Тогда
				ЭлементОтбораНайден = Истина;
				Если ЭлементОтбора.ИдентификаторПользовательскойНастройки <> "" Тогда
					ЭлементОтбора = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЭлементОтбораНайден Тогда
			ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки;
		КонецЕсли;
		
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ПолеОтбора.Значение;
		
	КонецЦикла;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьПериодСКД(КомпоновщикНастроек, НачалоПериода, КонецПериода)
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ПараметрДанных.ИдентификаторПользовательскойНастройки <> "" Тогда
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПараметрДанных = ПользовательскийПараметр;
		КонецЕсли;
	КонецЕсли;
	
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = НачалоПериода;
	Период.ДатаОкончания = КонецПериода;
	
	ПараметрДанных.Использование = Истина;
	ПараметрДанных.Значение = Период;
	
КонецФункции


#КонецОбласти
